lvx/base/InformationRegisters/бит_ЗначенияПараметровФинансовыхДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияПараметровФинансовыхДоговоров</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыПараметровФинансовыхДоговоров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СоставляющаяПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СоставляющиеПлатежейПоФинДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыПараметровФинансовыхДоговоров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_НоминальныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_НоминальныеСтавки</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяСоставляющая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ВидыДополнительныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставляющиеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СоставляющаяПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СоставляющиеПлатежейПоФинДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыПараметровФинансовыхДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыПараметровФинансовыхДоговоров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/CommonModules/бит_Договоры/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыСемействаЕРП

// Функция проверяет корректность объекта расчетов.
//
// Параметры:
//  ОбъектРасчетов - СправочникСсылка.ДоговорыКонтрагентов, СправочникСсылка.ДоговорыКредитовИДепозитов,
//						СправочникСсылка.ДоговорыАренды, СправочникСсылка.ДоговорыМеждуОрганизациями,
//						СправочникСсылка.СоглашенияСКлиентами, СправочникСсылка.СоглашенияСПоставщиками.
//  ВалютаДокумента - СправочникСсылка.Валюты.
//  БанкКасса.
//
// Возвращаемое значение:
//  Булево.
//
Функция КорректныйОбъектРасчетов(ОбъектРасчетов, ВалютаДокумента, БанкКасса) Экспорт

	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		Если ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыКонтрагентов") 
			ИЛИ ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов")
			ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			     И ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыАренды"))
			ИЛИ ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")
	        ИЛИ ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.СоглашенияСКлиентами")
			ИЛИ ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
			
			Договор = ОбъектРасчетов;
			
		Иначе
			
			Если ЗначениеЗаполнено(ОбъектРасчетов.Договор) Тогда
				Договор = ОбъектРасчетов.Договор;
			Иначе
				Договор = ОбъектРасчетов;
			КонецЕсли;
			
		КонецЕсли;
		
		МетаданныеОбъекта = Договор.Метаданные();
		Если МетаданныеОбъекта.Реквизиты.Найти("ВалютаВзаиморасчетов") <> Неопределено 
			И МетаданныеОбъекта.Реквизиты.Найти("ОплатаВВалюте") <> Неопределено Тогда
						
			ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
			
			Если ЗначениеЗаполнено(Договор) И БанкКасса <> Неопределено Тогда 
				
				// 1 строка
				Если Договор.ВалютаВзаиморасчетов = ВалютаРуб 
					И ВалютаДокумента = ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств = ВалютаРуб
					И НЕ Договор.ОплатаВВалюте Тогда
										
				    Результат = Истина;
					
				// 2 строка
				ИначеЕсли Договор.ВалютаВзаиморасчетов <> ВалютаРуб 
					И ВалютаДокумента = ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств = ВалютаРуб
					И НЕ Договор.ОплатаВВалюте Тогда
										
					Результат = Истина;

				// 4 строка
				ИначеЕсли Договор.ВалютаВзаиморасчетов <> ВалютаРуб 
					И ВалютаДокумента <> ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств <> ВалютаРуб
				    И Договор.ВалютаВзаиморасчетов = ВалютаДокумента
					И Договор.ОплатаВВалюте Тогда
										
					Результат = Истина;
					
				// 7 строка
				ИначеЕсли Договор.ВалютаВзаиморасчетов <> ВалютаРуб 
					И ВалютаДокумента <> ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств = ВалютаРуб
					И Договор.ВалютаВзаиморасчетов = ВалютаДокумента
					И НЕ Договор.ОплатаВВалюте Тогда
										
					Результат = Истина;

				// 3 строка
				ИначеЕсли Договор.ВалютаВзаиморасчетов = ВалютаРуб 
					И ВалютаДокумента <> ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств <> ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств = ВалютаДокумента
					И Договор.ОплатаВВалюте Тогда
										
					Результат = Истина;

				// 5 строка
				ИначеЕсли Договор.ВалютаВзаиморасчетов <> ВалютаРуб 
					И ВалютаДокумента <> ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств <> ВалютаРуб
				    И Договор.ВалютаВзаиморасчетов = ВалютаДокумента
					И Договор.ВалютаВзаиморасчетов = БанкКасса.ВалютаДенежныхСредств
					И Договор.ОплатаВВалюте Тогда
					
					Результат = Истина;
					
				// 6 строка	
				ИначеЕсли Договор.ВалютаВзаиморасчетов = ВалютаРуб 
					И ВалютаДокумента <> ВалютаРуб
					И БанкКасса.ВалютаДенежныхСредств = ВалютаРуб
					И НЕ Договор.ОплатаВВалюте Тогда
										
					Результат = Истина;

				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(Договор) Тогда 
				
				Если ВалютаДокумента <> ВалютаРуб
					И Договор.ВалютаВзаиморасчетов <> ВалютаРуб
					И Договор.ВалютаВзаиморасчетов <> ВалютаДокумента Тогда
					
				    Результат = Ложь;

				ИначеЕсли ВалютаДокумента = ВалютаРуб
					И Договор.ВалютаВзаиморасчетов = ВалютаРуб
					И Договор.ОплатаВВалюте Тогда
										
				    Результат = Ложь;
					
				Иначе
					
					Результат = Истина;
					
				КонецЕсли;
						
			Иначе
				
				Результат = Истина;
				
			КонецЕсли;
			
		Иначе
		
			Результат = Истина;

		КонецЕсли;
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // КорректныйОбъектРасчетов()

#КонецОбласти

#Область ПроцедурыПоЗатратам

// Функция получает плановую и фактическую сумму затрат по заявке.
// 
// Параметры:
//  Заявка			  - ДокументСсылка.бит_ЗаявкаНаЗатраты, Массив.
//  РасходныйДокумент - Расходный документ ссылка. По умолчанию Неопределено.
// 
// Возвращаемое значение:
//   РезСтруктура - 1. Структура 	- Заявка - ДокументСсылка.бит_ЗаявкаНаЗатраты
//                  2. Соответствие - Заявка - Массив.
// 
Функция ПолучитьЗатратыПоЗаявке(Заявка, РасходныйДокумент = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаПлан"				, 0);
	Результат.Вставить("СуммаЗатраты"			, 0);
	Результат.Вставить("СуммаЗакрыта"			, 0);
	Результат.Вставить("Разность"				, 0);
	Результат.Вставить("СуммаДокументаПлан"	, 0);
	Результат.Вставить("СуммаДокументаЗатраты"	, 0);
	Результат.Вставить("СуммаДокументаЗакрыта"	, 0);
	Результат.Вставить("СуммаДокументаРазность", 0);
	
	Возврат Результат;
	
КонецФункции // ПолучитьЗатратыПоЗаявке()

// Функция определяет состояние затрат по заявке.
// 
// Параметры:
//  ЗатратыСтруктура  - Структура - получена с помощью функции ПолучитьЗатратыПоЗаявке.
// 
// Возвращаемое значение:
//   РезСостояние   - СправочникСсылка.бит_СтатусыОбъектов.
// 
Функция ОпределитьСостояниеЗатрат(ЗатратыСтруктура) Экспорт
	
	РезСостояние = Справочники.бит_СтатусыОбъектов.ПустаяСсылка();
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	Возврат РезСостояние;
	
КонецФункции // ОпределитьСостояниеЗатрат()

// Процедура проверяет возможность записи документа планирования. 
// Отслеживается изменение пометки на удаление.
// 
// Параметры:
//  ДокументОбъект - объект документа.
//  Отказ          - Булево, флаг отказа выполнения действия, выставляется в Истину
//                   когда документ используется в графике начислений.
// 
Процедура ПроверитьВозможностьЗаписиДокументаПланирования(ДокументОбъект, Отказ) Экспорт
    
	Если ДокументОбъект.ЭтоНовый() Тогда
		Возврат;	
	КонецЕсли; 
	
	ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Ссылка, "ПометкаУдаления");
    
    Если ДокументОбъект.ПометкаУдаления = ПометкаУдаления Тогда
        Возврат;
    КонецЕсли;
    
    // Попытаемся найти график начислений.
	ГрафикНачислений = НайтиДокументГрафикаНачислений(ДокументОбъект.Ссылка);
    
    Если ЗначениеЗаполнено(ГрафикНачислений) Тогда
		ТекстСообщения = НСтр("ru='Установка пометки удаления %1. Помечать документ на удаление возможно только из графика начислений.';
							  |en='Setting the delete mark %1. You can only mark a document for deletion from the accrual schedule.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументОбъект);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект, , ,Отказ); 
	КонецЕсли;
    
КонецПроцедуры

// Процедура выполняет синхронизацию пометки на удаление документа "Дополнительные условия по договору"
// и документов планирования указанных в графике начислений.
// 
// Параметры:
//  ДокументОбъект - объект документа, ДокументОбъект.бит_ДополнительныеУсловияПоДоговору. 
// 
Процедура СинхронизацияПометкиНаУдалениеУДокументовПланирования(ДокументОбъект, Отказ = Ложь) Экспорт

    ПометкаНаУдалениеДокумента = ДокументОбъект.ПометкаУдаления;
    
    Если ПометкаНаУдалениеДокумента <> ДокументОбъект.Ссылка.ПометкаУдаления Тогда
        
		Если ПометкаНаУдалениеДокумента Тогда
			Операция = НСтр("ru='Установка';en='Installation'"); 
		Иначе	
			Операция = НСтр("ru='Снятие';en='Removal'"); 
		КонецЕсли; 			
        Заголовок = НСтр("ru='%1 пометки удаления. %2';en='%1 delete marks. %2'");
		Заголовок = СтрШаблон(Заголовок, Операция, ДокументОбъект);
		
        // Получаем документы поступления.
        Запрос = Новый Запрос;
        Запрос.УстановитьПараметр("ГрафикНачислений", ДокументОбъект.Ссылка);
        
        Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |   ГрафикНачислений.ДокументПланирования
        |ИЗ
        |   Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК ГрафикНачислений
        |ГДЕ
        |   ГрафикНачислений.Ссылка = &ГрафикНачислений
        |   И (НЕ ГрафикНачислений.ДокументПланирования = НЕОПРЕДЕЛЕНО)";
        
        РезультатЗапроса = Запрос.Выполнить();
        
        Если РезультатЗапроса.Пустой() Тогда
            Возврат;
        КонецЕсли;
        
        ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
        
        Пока ВыборкаИзЗапроса.Следующий() Цикл
            Если ЗначениеЗаполнено(ВыборкаИзЗапроса.ДокументПланирования) Тогда
                
                Установлена = бит_ОбщегоНазначения.ИзменитьПометкуНаУдалениеУОбъекта(ВыборкаИзЗапроса.ДокументПланирования, ПометкаНаУдалениеДокумента, 
                                                                                     Заголовок,, Новый Структура("ЭтоПометкаИзГрафикаНачислений"));
                Если Не Отказ И Не Установлена Тогда
                    Отказ = Истина;
					Прервать;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПоСозданиюИЗаполнениюДокументовПоЗатратам

// Процедура заполняет дополнительные аналитики из расходной позиции.
// 
// Параметры:
//  ДокСсылка		   - ДокументСсылка.*
//  РасходнаяПозиция   - ДокументСсылка.бит_РасходнаяПозиция
//  НастройкиИзмерений - Структура (По умолчанию = Неопределено)
//  РежимСообщений 	   - Строка (По умолчанию = "Нет").
// 
Процедура ЗаполнитьДополнительныеАналитикиПоРасходнойПозиции(НаборЗаписейАналитики, ДокСсылка, РасходнаяПозиция, НастройкиИзмерений = Неопределено, РежимСообщений = "Нет") Экспорт

	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли;
		
	// Очистим набор записей от значений заполненных по умолчанию.
	НаборЗаписейАналитики.Очистить();
	
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "РасходнаяПозиция"    , РасходнаяПозиция);
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "Проект"              , РасходнаяПозиция.ДокументОснование.Проект);
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "СтатьяОборотов"      , РасходнаяПозиция.ДокументОснование.СтатьяОборотов);
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "ЦФО"                 , РасходнаяПозиция.ДокументОснование.ЦФО);
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "НоменклатурнаяГруппа", РасходнаяПозиция.ДокументОснование.НоменклатурнаяГруппа);				
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "Контрагент"          , РасходнаяПозиция.ДокументОснование.Контрагент);
	бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики, ДокСсылка, "ДоговорКонтрагента"  , РасходнаяПозиция.ДокументОснование.ДоговорКонтрагента);
	
	ДокОснование        = РасходнаяПозиция.ДокументОснование;
	МетаданныеДокумента = ДокОснование.Метаданные();
	
	Для каждого ТекущаяНастройка Из НастройкиИзмерений Цикл
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ТекущаяНастройка.Ключ, МетаданныеДокумента)
			И ЗначениеЗаполнено(ДокОснование[ТекущаяНастройка.Ключ]) Тогда
			
			бит_ОбщегоНазначения.ДобавитьЗаписьАналитик(НаборЗаписейАналитики
														, ДокСсылка
														, ТекущаяНастройка.Значение.Аналитика
														, ДокОснование[ТекущаяНастройка.Ключ]);
														
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьДополнительныеАналитикиПоРасходнойПозиции()

#КонецОбласти

#Область ПроцедурыРаботыСДоговорами

// Функция находит договор контрагента созданный на основании проекта договора.
// 
// Параметры:
// 	ПроектДоговора   - ДокументСсылка.бит_ПроектДоговора - проект для которого надо найти договор.
// 	ВозвращатьМассив - Булево - Истина - будет возвращен массив, возможно несколько элементов в массиве
// 								Ложь   - будет возвращена ссылка на договор или Неопределено.
// 
// Возвращаемое значение:
// 	Массив, Неопределено, СправочникСсылка.ДоговорыКонтрагентов.
// 
Функция ДоговорКонтрагентаПоПроектуДоговора(ПроектДоговора, ВозвращатьМассив = Ложь) Экспорт

	// ++ ЕРП 
	МассивДоговоров = ?(ВозвращатьМассив, Новый Массив, Неопределено);
			
    Возврат МассивДоговоров;
	// -- ЕРП 
	
КонецФункции

// Функция создает договор контрагента на основании проекта договора.
// 
// Параметры:
// 	ПроектДоговора - ДокументСсылка.бит_ПроектыДоговора - проект для которого надо создать договор.
// 	РежимСообщений - строка - "Все", "Ошибки" - регулятор, информацию о каких событиях надо предоставлять пользователю.
// 
// Возвращаемое значение:
// 	Результат - СправочникСсылка.ДоговорКонтрагента, Неопределено.
// 
Функция СоздатьДоговорНаОснованииПроекта(ПроектДоговора, РежимСообщений="Нет") Экспорт
	
	// ++ ЕРП 
	Результат = Неопределено;

	Возврат Результат;
	// -- ЕРП 
	
КонецФункции

Функция РасчетыВУсловныхЕдиницах(ДоговорКонтрагента) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "ВалютаВзаиморасчетов,ОплатаВВалюте");
	
	Возврат ВалютаРегламентированногоУчета <> ДанныеДоговора.ВалютаВзаиморасчетов И НЕ ДанныеДоговора.ОплатаВВалюте;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыРаботыСПараметрамиСоставляющихПлатежаФинДоговоров

// Функция формирует дерево параметров финансового договора.
// 
// Параметры:
// 	ИсточникЗаполнения - СправочникСсылка.ДоговорыКонтрагентов, 
// 						ДокументСсылка.бит_ПроектДоговора, 
// 						СправочникСсылка.бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам.
// 
Функция ДанныеПараметровФинДоговоров(ИсточникЗаполнения) Экспорт
	
	Если ТипЗнч(ИсточникЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда		
		РежимЗаполнения = "ПоДоговору";
	// ++ЕРП
	ИначеЕсли Метаданные.НайтиПоПолномуИмени("Справочник.ДоговорыКредитовИДепозитов") <> Неопределено  
		    И ТипЗнч(ИсточникЗаполнения) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда 	
		РежимЗаполнения = "ПоДоговору";
	// --ЕРП
	ИначеЕсли ТипЗнч(ИсточникЗаполнения) = Тип("СправочникСсылка.бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам") Тогда
		РежимЗаполнения = "ПоСпособуРасчета";
	Иначе
		РежимЗаполнения = "";
	КонецЕсли;
	                                                                 
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЗначенияПараметровФинансовыхДоговоров.Параметр КАК Параметр,
	|	бит_ЗначенияПараметровФинансовыхДоговоров.ЗначениеПараметра КАК Значение,
	|	ВЫБОР
	|		КОГДА бит_ЗначенияПараметровФинансовыхДоговоров.СоставляющаяПлатежа = ЗНАЧЕНИЕ(Справочник.бит_СоставляющиеПлатежейПоФинДоговорам.ПустаяСсылка)
	|			ТОГДА ""Общие параметры""
	|		ИНАЧЕ бит_ЗначенияПараметровФинансовыхДоговоров.СоставляющаяПлатежа
	|	КОНЕЦ КАК СоставляющаяПлатежа
	|ПОМЕСТИТЬ ПараметрыСпособаРасчетаПоДоговору
	|ИЗ
	|	РегистрСведений.бит_ЗначенияПараметровФинансовыхДоговоров КАК бит_ЗначенияПараметровФинансовыхДоговоров
	|ГДЕ
	|	бит_ЗначенияПараметровФинансовыхДоговоров.ДоговорКонтрагента = &ИсточникЗаполнения
	|	И ВЫБОР
	|			КОГДА &РежимЗаполнения = ""ПоДоговору""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СоставляющиеПлатежа.Параметр,
	|	СоставляющиеПлатежа.ЗначениеПоУмолчанию,
	|	ВЫБОР
	|		КОГДА СоставляющиеПлатежа.СоставляющаяПлатежа = ЗНАЧЕНИЕ(Справочник.бит_СоставляющиеПлатежейПоФинДоговорам.ПустаяСсылка)
	|			ТОГДА ""Общие параметры""
	|		ИНАЧЕ СоставляющиеПлатежа.СоставляющаяПлатежа
	|	КОНЕЦ
	|ИЗ
	|	Справочник.бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам.СоставляющиеПлатежа КАК СоставляющиеПлатежа
	|ГДЕ
	|	СоставляющиеПлатежа.Ссылка = &ИсточникЗаполнения
	|	И ВЫБОР
	|			КОГДА &РежимЗаполнения = ""ПоСпособуРасчета""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСпособаРасчетаПоДоговору.Параметр,
	|	ПараметрыСпособаРасчетаПоДоговору.Значение,
	|	ПараметрыСпособаРасчетаПоДоговору.СоставляющаяПлатежа КАК СоставляющаяПлатежа,
	|	ПараметрыСпособаРасчетаПоДоговору.СоставляющаяПлатежа.ТипПлатежаПоФинДоговору КАК ТипПлатежа,
	|	ПараметрыСпособаРасчетаПоДоговору.Параметр.Обязательный КАК Обязательный
	|ИЗ
	|	ПараметрыСпособаРасчетаПоДоговору КАК ПараметрыСпособаРасчетаПоДоговору
	|ИТОГИ ПО
	|	СоставляющаяПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПараметрыСпособаРасчетаПоДоговору";
				   
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ИсточникЗаполнения"	, ИсточникЗаполнения);
	Запрос.УстановитьПараметр("РежимЗаполнения"		, РежимЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоПараметров = Новый ДеревоЗначений;
	
	МассивТиповЗначенийПараметров = Метаданные.ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.Тип.Типы();
	
	МассивТиповГруппировка = Новый Массив;
	МассивТиповГруппировка.Добавить(Тип("СправочникСсылка.бит_СоставляющиеПлатежейПоФинДоговорам"));
	МассивТиповГруппировка.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыПараметровФинансовыхДоговоров"));
	МассивТиповГруппировка.Добавить(Тип("Строка"));
	
	ДеревоПараметров.Колонки.Добавить("Группировка"			, Новый ОписаниеТипов(МассивТиповГруппировка));
	ДеревоПараметров.Колонки.Добавить("СоставляющаяПлатежа"	, Новый ОписаниеТипов("СправочникСсылка.бит_СоставляющиеПлатежейПоФинДоговорам"));
	ДеревоПараметров.Колонки.Добавить("Параметр"			, Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.бит_ВидыПараметровФинансовыхДоговоров"));
	ДеревоПараметров.Колонки.Добавить("Значение"			, Новый ОписаниеТипов(МассивТиповЗначенийПараметров));
	ДеревоПараметров.Колонки.Добавить("ТипПлатежа"			, Новый ОписаниеТипов("ПеречислениеСсылка.бит_ТипыПлатежейПоФинансовымДоговорам"));
	ДеревоПараметров.Колонки.Добавить("Обязательный"		, Новый ОписаниеТипов("Булево"));
	                                                                              
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		// Добавим в дерево составляющую платежа
		СтрокаДереваПараметров = ДеревоПараметров.Строки.Добавить();
		СтрокаДереваПараметров.Группировка		   = Выборка.СоставляющаяПлатежа;
		СтрокаДереваПараметров.СоставляющаяПлатежа = Выборка.СоставляющаяПлатежа;
		Если НЕ ТипЗнч(Выборка.СоставляющаяПлатежа) = Тип("Строка") Тогда
			СтрокаДереваПараметров.ТипПлатежа = Выборка.СоставляющаяПлатежа.ТипПлатежаПоФинДоговору;
		КонецЕсли;
		
		ВыборкаПараметров = Выборка.Выбрать();
		
		// Заполним параметры составляющей платежа
		Пока ВыборкаПараметров.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаПараметров.Параметр) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПараметра = СтрокаДереваПараметров.Строки.Добавить();
			
			СтрокаПараметра.Группировка			= ВыборкаПараметров.Параметр;
			СтрокаПараметра.СоставляющаяПлатежа = ВыборкаПараметров.СоставляющаяПлатежа;
			СтрокаПараметра.Параметр			= ВыборкаПараметров.Параметр;
			СтрокаПараметра.ТипПлатежа			= ВыборкаПараметров.ТипПлатежа;
			СтрокаПараметра.Обязательный		= ВыборкаПараметров.Обязательный;
			
			Если НЕ ЗначениеЗаполнено(ВыборкаПараметров.Значение) Тогда
				СтрокаПараметра.Значение = СтрокаПараметра.Параметр.ТипЗначения.ПривестиЗначение();
			Иначе
				СтрокаПараметра.Значение = ВыборкаПараметров.Значение;
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	Возврат ДеревоПараметров;
	
КонецФункции

// Процедура записывает параметры финансового договора в регистр.
// 
// Параметры:
// 	ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов,
// 						 ДокументСсылка.бит_ПроектДоговора.
// 	ДеревоПараметров - ДеревоЗначений.
// 
Функция ЗаписатьПараметрыФинансовогоДоговора(ДоговорКонтрагента, ДеревоПараметров) Экспорт
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_ЗначенияПараметровФинансовыхДоговоров) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бит_ЗначенияПараметровФинансовыхДоговоров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ДоговорКонтрагента, Истина);
	
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Очистить();
	
	Организация = ДоговорКонтрагента.Организация;
	
	Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ (Метаданные.НайтиПоПолномуИмени("Справочник.ДоговорыКредитовИДепозитов") <> Неопределено  
		И ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов")) Тогда
		
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "Контрагент");
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ДеревоПараметров.Строки Цикл
		
		Для Каждого СтрокаПараметра Из ТекущаяСтрока.Строки Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Организация		    = Организация;
			НоваяЗапись.Контрагент		    = Контрагент;
			НоваяЗапись.ДоговорКонтрагента  = ДоговорКонтрагента;
			НоваяЗапись.СоставляющаяПлатежа = СтрокаПараметра.СоставляющаяПлатежа;
			НоваяЗапись.Параметр 			= СтрокаПараметра.Параметр;
			НоваяЗапись.ЗначениеПараметра 	= СтрокаПараметра.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборЗаписей);
	
	Возврат ДействиеВыполнено;
	
КонецФункции 

#КонецОбласти

#Область ПроцедурыОбработчикиПодписокНаСобытия

// Процедура - обработчик подписки на события "бит_ОбработкаПроведенияЗатраты".
// 
Процедура бит_ОбработкаПроведенияЗатратыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

// Процедура - обработчик подписки на события "бит_ОбработкаУдаленияПроведенияЗатраты".
// 
Процедура бит_ОбработкаУдаленияПроведенияЗатратыОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

// Процедура обработчик подписки "бит_ПередЗаписьюСправочникаДоговорыКонтрагентов" 
// на событие "ПередЗаписью".
// Выполняется синхронизация пометки на удаления у файлов и проверка заполненности дополнительных реквизитов.
// 
// Параметры:
//  Источник - СправочникОбъект.ДоговорыКонтрагентов.
//  Отказ 	 - Булево.
// 
Процедура бит_ПередЗаписьюСправочникаДоговорыКонтрагентовПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда		
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;	
	КонецЕсли; 			
		
	Если Не Источник.ЭтоНовый() И Не Источник.ПометкаУдаления = Источник.Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// Заголовок для сообщений об ошибках записи.
		ТекстЗаголовка = НСтр("ru='Запись договора контрагента ""%1"":'; 
					 	      |en='Counterparty contract entry ""%1"":'");
	    Заголовок = СтрШаблон(ТекстЗаголовка, Источник);
		
		// Выполним контроль типовых реквизитов влияющих на выбор реквизитов БИТ.
		Если НЕ Источник.бит_СтатьиОборотов.Количество() = 0
			И НЕ Источник.Ссылка.Пустая()
			И НЕ Источник.ДополнительныеСвойства.Свойство("мПрограммнаяЗапись") Тогда
			
			Если НЕ Источник.ТипДоговора = Источник.Ссылка.ТипДоговора Тогда
				
				ТекстСообщения = НСтр("ru='Изменился вид договора контрагента. Список статей оборотов в дополнительных реквизитах БИТ будет очищен'; 
								  	  |en='Type of counterparty contract has changed. List of turnover items in additional BIT details will be cleared'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Источник.бит_СтатьиОборотов.Очистить();
				
			ИначеЕсли НЕ Источник.Организация = Источник.Ссылка.Организация Тогда
				
				ТекстСообщения = НСтр("ru='Изменилась организация договора контрагента. Список статей оборотов в дополнительных реквизитах БИТ будет очищен';
								  	  |en='Change the organization of the contract counterparty. List of Articles revolutions additional details BIT is cleared'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Источник.бит_СтатьиОборотов.Очистить();
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Укажем, что надо проверить:
		СтруктураОбязательныхПолей = Новый Структура();
		СтруктураОбязательныхПолей.Вставить("СтатьяОборотов");
		
		// Теперь вызовем общую процедуру проверки.
		бит_РаботаСМетаданными.ПроверитьЗаполнениеТабличнойЧасти(Источник
															  ,"бит_СтатьиОборотов"
															  ,СтруктураОбязательныхПолей
															  ,Отказ
															  ,Заголовок);
		
		Если Не Отказ Тогда
			
			СтатьиОборотов 		 	  = Источник.бит_СтатьиОборотов;
			ОсновнаяСтатьяОборотов	  = Источник.бит_ОсновнаяСтатьяОборотов;
			ОсновнаяСтатьяОборотовБДР = Источник.бит_ОсновнаяСтатьяОборотовБДР;
			
			// Если не указаны статьи оборотов, тогда
			Если СтатьиОборотов.Количество() = 0 Тогда
				
				Источник.бит_ОсновнаяСтатьяОборотов	   = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
				Источник.бит_ОсновнаяСтатьяОборотовБДР = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
				
			ИначеЕсли НЕ СтатьиОборотов.Количество() = 0 Тогда
				
				// Если основные статьи не заполнены, заполним их сами случайными значениями из табличной части.
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТабСтатьиОборотов.НомерСтроки,
				|	ТабСтатьиОборотов.СтатьяОборотов
				|ПОМЕСТИТЬ СтатьиОборотов
				|ИЗ
				|	&ТабСтатьиОборотов КАК ТабСтатьиОборотов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СтатьиОборотов.НомерСтроки,
				|	СтатьиОборотов.СтатьяОборотов,
				|	СтатьиОборотов.СтатьяОборотов.ТипСтатьи КАК ТипСтатьи
				|ИЗ
				|	СтатьиОборотов КАК СтатьиОборотов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ СтатьиОборотов";
				Запрос.УстановитьПараметр("ТабСтатьиОборотов", СтатьиОборотов);
				
				Результат = Запрос.Выполнить();
				
				СтатьиОборотовДополненная = Результат.Выгрузить();
				
				СтрокаБДДС = СтатьиОборотовДополненная.Найти(Перечисления.бит_ТипыСтатейОборотов.БДДС, "ТипСтатьи");
				СтрокаБДР  = СтатьиОборотовДополненная.Найти(Перечисления.бит_ТипыСтатейОборотов.БДР , "ТипСтатьи");
				
				Если НЕ СтрокаБДДС = Неопределено Тогда
					СтатьяОборотовБДДСКандидат = СтрокаБДДС.СтатьяОборотов;
				Иначе
					СтатьяОборотовБДДСКандидат = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
				КонецЕсли;
				
				Если НЕ СтрокаБДР = Неопределено Тогда
					СтатьяОборотовБДРКандидат = СтрокаБДР.СтатьяОборотов;
				Иначе
					СтатьяОборотовБДРКандидат = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
				КонецЕсли;
				
				// Обработаем статью БДДС
				Если Не ЗначениеЗаполнено(ОсновнаяСтатьяОборотов) Тогда
					Источник.бит_ОсновнаяСтатьяОборотов = СтатьяОборотовБДДСКандидат;
				Иначе
					
					// Проверим наличие статьи оборотов в списке статей оборотов.
					Если СтатьиОборотов.Найти(ОсновнаяСтатьяОборотов, "СтатьяОборотов") = Неопределено Тогда
						Источник.бит_ОсновнаяСтатьяОборотов = СтатьяОборотовБДДСКандидат;
					КонецЕсли;
					
				КонецЕсли;
				
				// Обработаем статью БДР
				Если Не ЗначениеЗаполнено(ОсновнаяСтатьяОборотовБДР) Тогда
					Источник.бит_ОсновнаяСтатьяОборотовБДР = СтатьяОборотовБДРКандидат;
				Иначе
					
					// Проверим наличие статьи оборотов в списке статей оборотов.
					Если СтатьиОборотов.Найти(ОсновнаяСтатьяОборотовБДР, "СтатьяОборотов") = Неопределено Тогда
						Источник.бит_ОсновнаяСтатьяОборотовБДР = СтатьяОборотовБДРКандидат;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // бит_ПередЗаписьюСправочникаДоговорыКонтрагентовПередЗаписью()

// Процедура - обработчик подписки на события "бит_ПриКопированииСправочникаДоговорыКонтрагентов".
// 
Процедура бит_ПриКопированииСправочникаДоговорыКонтрагентовПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			
	
	Если ОбъектКопирования.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// ++ЕРП
	//Источник.бит_ПроектДоговора 		  = Неопределено;
	// --ЕРП
	Источник.бит_СпособРасчетаФинПлатежей = Неопределено;
	
КонецПроцедуры

// Процедура - обработчик подписки бит_ОбработкаЗаполненияДоговорКонтрагента.
// Выполняет заполнение реквизита "Ответственный" элемента справочника "ДоговорыКонтрагентов".
// 
Процедура бит_ОбработкаЗаполненияДоговорКонтрагентаОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;
	КонецЕсли; 		

	РеквизитыДог = Источник.Метаданные().Реквизиты;
	
	Если РеквизитыДог.Найти("бит_ВысокийПриоритетПриЗаполненииАналитик") <> Неопределено Тогда
		
		ВысокийПриоритет = бит_НастройкиПрограммы.УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитик(
								Новый Структура("Организация", Источник.Организация), ТекущаяДатаСеанса());
		Если ВысокийПриоритет Тогда			
			Источник.бит_ВысокийПриоритетПриЗаполненииАналитик = Истина;			
		КонецЕсли;
	      	
	КонецЕсли;

	Если РеквизитыДог.Найти("бит_Ответственный") <> Неопределено Тогда

		Если Не ЗначениеЗаполнено(Источник.бит_Ответственный) И НЕ Источник.ЭтоГруппа Тогда
			
			ТекПользователь = Пользователи.ТекущийПользователь();
			Источник.бит_Ответственный = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ОсновнойОтветственный", ТекПользователь);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры // бит_ОбработкаЗаполненияДоговорКонтрагентаОбработкаЗаполнения()

#КонецОбласти

#Область ПроцедурыИФункцииКонтроляСуммИСроковПоДоговорам

// Функция вычисляет контрольную сумму по проектам договоров.
// 
// Параметры:
//  ПроектДоговора - СправочникСсылка.
//  ДатаПроведения - Дата.
// 
Функция ВычислитьКонтрольныеДатыПоПроектам(ПроектДоговора) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;
	Проект = ПроектДоговора;
	
	МинДата = ?(ЗначениеЗаполнено(ПроектДоговора.ДатаДоговора), ПроектДоговора.ДатаДоговора, Дата(1,1,1));
	МаксДата = ?(ЗначениеЗаполнено(ПроектДоговора.СрокДействия), ПроектДоговора.СрокДействия, Дата(3999,1,1));

	Переход = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПроектДоговора.Ссылка,
		|	бит_ПроектДоговора.ДатаДоговора КАК ДатаОт,
		|	бит_ПроектДоговора.СрокДействия КАК ДатаДо
		|ИЗ
		|	Документ.бит_ПроектДоговора КАК бит_ПроектДоговора
		|ГДЕ
		|	бит_ПроектДоговора.ОсновнойДоговор = &ПроектДоговора
		|	И бит_ПроектДоговора.ДополняютсяУсловияОсновногоДоговора = ИСТИНА";

		
	ОсновнойПроектДоговора = Документы.бит_ПроектДоговора.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(ПроектДоговора.ОсновнойДоговор) Тогда
				
		Запрос.УстановитьПараметр("ПроектДоговора", ПроектДоговора);
		
	ИначеЕсли ЗначениеЗаполнено(ПроектДоговора.ОсновнойДоговор) И ПроектДоговора.ДополняютсяУсловияОсновногоДоговора Тогда
		
		Запрос.УстановитьПараметр("ПроектДоговора", ПроектДоговора.ОсновнойДоговор);
		
		Проект = ПроектДоговора.ОсновнойДоговор;

		МинДата = ?(ЗначениеЗаполнено(ПроектДоговора.ДатаДоговора), ПроектДоговора.ОсновнойДоговор.ДатаДоговора, Дата(1,1,1));
	    МаксДата = ?(ЗначениеЗаполнено(ПроектДоговора.СрокДействия), ПроектДоговора.ОсновнойДоговор.СрокДействия, Дата(3999,1,1));

	ИначеЕсли ЗначениеЗаполнено(ПроектДоговора.ОсновнойДоговор) И Не ПроектДоговора.ДополняютсяУсловияОсновногоДоговора Тогда
				
		Переход = Истина;
		
	КонецЕсли;
	
	Если Не Переход Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл
				
				МинДата = ?(Выборка.ДатаОт < МинДата, Выборка.ДатаОт, МинДата);
				МаксДата = ?(Выборка.ДатаДо > МаксДата, Выборка.ДатаДо, МаксДата);
				
			КонецЦикла;

		КонецЕсли;	
		
	КонецЕсли;
	
	Результат.Вставить("ДатаОт", МинДата);
	Результат.Вставить("ДатаДо", МаксДата);
    Результат.Вставить("ПроектДоговора", Проект);
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;
	
КонецФункции

// Процедура проводит контроль сумм по договору.
//
// Параметры:
//  Объект - ДокументОбъект.
//  Отказ - Булево.
//
Процедура ПровестиКонтрольСумм(Объект, Отказ) Экспорт

	СтруктураПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
        СтруктураПараметров.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	
    Если ЗначениеЗаполнено(Объект.ЦФО) Тогда
		СтруктураПараметров.Вставить("ЦФО", Объект.ЦФО);
    КонецЕсли;

	ВариантКонтроля = бит_НастройкиПрограммы.КонтролироватьПревышенияСуммыПоДоговору(СтруктураПараметров, Объект.Дата);	

	Если ВариантКонтроля <> Перечисления.бит_ВидыКонтроля.НеКонтролировать И ЗначениеЗаполнено(ВариантКонтроля) Тогда 
		
		ОсновнойПроектДоговора = Неопределено;
		// ++ ЕРП 
		Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			
			КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", 
							Объект.ДоговорКонтрагента.ВалютаВзаиморасчетов)).Курс;
			КонтрольнаяСумма = Объект.ДоговорКонтрагента.бит_СуммаДоговора * КурсВалюты;
			
			ДоговорКонтрагента = Объект.ДоговорКонтрагента;
		КонецЕсли;
		// -- ЕРП 	
		
		СписокДоговоров        = Неопределено;
				
		КонтролируемаяСумма = ВычислитьКонтролируемуюСуммуПоПроектам(Объект.ПроектДоговора, ДоговорКонтрагента, ОсновнойПроектДоговора, СписокДоговоров);
		
		СуммаПревышения = 0;
		Если КонтрольнаяСумма < КонтролируемаяСумма Тогда
			СуммаПревышения = КонтролируемаяСумма - КонтрольнаяСумма;
		КонецЕсли;
		
		Если СуммаПревышения > 0 Тогда 
			
			ТекстПредупреждения = НСтр("ru='Сумма по документу превышает контрольную сумму на %1 руб. Размер контрольной суммы составляет %2 руб.';
									   |en='The amount of the document exceeds the checksum for %1 rubles. The size of the checksum is %2 rubles.'");
			ТекстПредупреждения = СтрШаблон(ТекстПредупреждения, СуммаПревышения, КонтрольнаяСумма);			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстПредупреждения, Объект);
			
			Если ВариантКонтроля = Перечисления.бит_ВидыКонтроля.Контролировать Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры // ПровестиКонтрольСумм()

// Процедура осуществляет проверка суммы при проведении заявки.
//
// Параметры:
//  Заявка - ДокументыСсылка.
//  Отказ - Булево.
//
Процедура ПровестиКонтрольСуммПоЗаявкам(Заявка, Отказ) Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры // ПровестиКонтрольСуммПоЗаявкам()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ДанныеЗадолженности(Знач ДоговорКонтрагента = Неопределено,
							Знач Контрагент = Неопределено,
							Знач Организация = Неопределено) Экспорт
	
	ДанныеЗадолженности = Новый Структура;
	ДанныеЗадолженности.Вставить("ДебиторскаяЗадолженность",  0);
	ДанныеЗадолженности.Вставить("КредиторскаяЗадолженность", 0);
	
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента)
		И НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ДанныеЗадолженности;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если Контрагент = Неопределено Тогда
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "Владелец");
	КонецЕсли;
	
	// ++ НЕ УТ
	Запрос       = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(ХозрасчетныйОстатки.СуммаРазвернутыйОстатокДт) КАК ДебиторскаяЗадолженность,
	|	СУММА(ХозрасчетныйОстатки.СуммаРазвернутыйОстатокКт) КАК КредиторскаяЗадолженность
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			,
	|			Счет В (&СписокСчетов),
	|			&СубконтоКонтрагентДоговор,
	|			&ОтборОрганизация
	|				И &ОтборКонтрагент
	|				И &ОтборДоговорКонтрагента) КАК ХозрасчетныйОстатки";
	
	ОтборОрганизация = "ИСТИНА";
	Если ЗначениеЗаполнено(Организация) Тогда
		ОтборОрганизация = "Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборОрганизация", ОтборОрганизация);
	
	ОтборКонтрагент = "ИСТИНА";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОтборКонтрагент = "Субконто1 = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборКонтрагент", ОтборКонтрагент);
	
	ОтборДоговорКонтрагента = "ИСТИНА";
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ОтборДоговорКонтрагента = "Субконто2 = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборДоговорКонтрагента", ОтборДоговорКонтрагента);
	
	СубконтоКонтрагентДоговор = Новый СписокЗначений;
	СубконтоКонтрагентДоговор.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентДоговор.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос.УстановитьПараметр("СубконтоКонтрагентДоговор", СубконтоКонтрагентДоговор);
	Запрос.УстановитьПараметр("СписокСчетов",              СчетаРасчетовСКонтрагентами());
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка      = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеЗадолженности, Выборка);
	КонецЕсли;
	// -- НЕ УТ
	
	Возврат ДанныеЗадолженности;
	
КонецФункции

// Получает список счетов расчтеов с контрагентами.
//
// Параметры:
//	Нет.
// 
// Возвращаемое значение:
// 	Массив - Массив счетов
//		* СчетСсылка
//
Функция СчетаРасчетовСКонтрагентами() Экспорт
	
	// ++ НЕ УТ
	ИсключенныеСчета = Новый Массив;
	
	//Исключаем счета для расчета с бюджетом
	ИсключенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.НДСТаможенныйСоюзКУплате);	//68.42
	ИсключенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента);		//68.32
	
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ИсключенныеСчета", ИсключенныеСчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыСубконтоКонтрагенты.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоДоговоры
	|		ПО ВидыСубконтоКонтрагенты.Ссылка = ВидыСубконтоДоговоры.Ссылка
	|ГДЕ
	|	ВидыСубконтоКонтрагенты.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты)
	|	И НЕ ВидыСубконтоКонтрагенты.Ссылка.Забалансовый
	|	И НЕ ВидыСубконтоКонтрагенты.Ссылка В ИЕРАРХИИ (&ИсключенныеСчета)
	|	И ВидыСубконтоДоговоры.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	// -- НЕ УТ
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция пересчитывает сумму документа по табличным частям.
// 
Функция ПересчетСуммТабличныхЧастейДокумента(ДокументЗатрат, МетаданныеДокумента)

	БДРПланируетсяСНДС = бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной("бит_БДРПланируетсяСНДС");
	
	СуммаДокумента = 0;
	
	Для каждого ТабЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		Если ТабЧасть.Реквизиты.Найти("Сумма") <> Неопределено Тогда
		
			ИмяТабЧасти = ТабЧасть.Имя;
			
			ДокТЧ = ДокументЗатрат[ИмяТабЧасти].Выгрузить();
			
			Сумма = ДокТЧ.Итог("Сумма");
			
			Если ТабЧасть.Реквизиты.Найти("СуммаНДС") <> Неопределено Тогда
			
				СуммаНДС = ДокТЧ.Итог("СуммаНДС");
				
			Иначе 	
				СуммаНДС = 0;
			КонецЕсли; 
			
			Если БДРПланируетсяСНДС 
				И ДокументЗатрат.СуммаВключаетНДС Тогда
			
				СуммаДокумента = СуммаДокумента + Сумма;
				
			ИначеЕсли БДРПланируетсяСНДС 
				И НЕ ДокументЗатрат.СуммаВключаетНДС Тогда
				
				СуммаДокумента = СуммаДокумента + Сумма + СуммаНДС;
				
			ИначеЕсли НЕ БДРПланируетсяСНДС 
				И ДокументЗатрат.СуммаВключаетНДС Тогда
				
				СуммаДокумента = СуммаДокумента + Сумма - СуммаНДС;
				
			ИначеЕсли НЕ БДРПланируетсяСНДС 
				И НЕ ДокументЗатрат.СуммаВключаетНДС Тогда
				
				СуммаДокумента = СуммаДокумента + Сумма;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
		
	Возврат СуммаДокумента;
	
КонецФункции // ПересчетСуммТабличныхЧастейДокумента()

Процедура ЗаполнитьНоминальныеСтавкиДоговораИзПроекта(Договор, ПроектДоговора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_му_НоминальныеСтавки.Период,
	|	бит_му_НоминальныеСтавки.ДоговорКонтрагента,
	|	бит_му_НоминальныеСтавки.Ставка,
	|	бит_му_НоминальныеСтавки.ДополнительнаяСоставляющая
	|ИЗ
	|	РегистрСведений.бит_му_НоминальныеСтавки КАК бит_му_НоминальныеСтавки
	|ГДЕ
	|	бит_му_НоминальныеСтавки.ДоговорКонтрагента = &ПроектДоговора";
	
	Запрос.УстановитьПараметр("ПроектДоговора", ПроектДоговора);
	
	Результат = Запрос.Выполнить();
	
	НаборЗаписей = РегистрыСведений.бит_му_НоминальныеСтавки.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Договор, Истина);
	
	НаборЗаписей.Прочитать();
	
	ТаблицаДляЗагрузки = Результат.Выгрузить();
	ТаблицаДляЗагрузки.ЗаполнитьЗначения(Договор, "ДоговорКонтрагента");
	
	НаборЗаписей.Загрузить(ТаблицаДляЗагрузки);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция вычисляет контролируемую сумму по заявкам. 
// 
// Параметры:
//  ДоговорКонтрагента - СправочникСсылка.
//  СписокДоговоров - Список значение.
// 
Функция ВычислитьКонтролируемуюСуммуПоЗаявкам(ДоговорКонтрагента, СписокДоговоров)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(бит_ПланируемыйРасходДенежныхСредствОбороты.СуммаРеглПриход, 0)) КАК СуммаПриход
		|ПОМЕСТИТЬ ОбщиеДанные
		|ИЗ
		|	РегистрНакопления.бит_ПланируемыйРасходДенежныхСредств.Обороты(, , Регистратор, ДокументПланирования ССЫЛКА Документ.бит_ЗаявкаНаРасходованиеСредств) КАК бит_ПланируемыйРасходДенежныхСредствОбороты
		|ГДЕ
		|	бит_ПланируемыйРасходДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.бит_ЗаявкаНаРасходованиеСредств
		|	И &Условие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(бит_ПланируемыйРасходДенежныхСредствОбороты.СуммаРеглРасход, 0)) КАК СуммаРасход
		|ПОМЕСТИТЬ ДанныеПоДокументамЗакрытия
		|ИЗ
		|	РегистрНакопления.бит_ПланируемыйРасходДенежныхСредств.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ДокументПланирования ССЫЛКА Документ.бит_ЗаявкаНаРасходованиеСредств
		|				ИЛИ ДокументПланирования ССЫЛКА Документ.бит_ПлатежнаяПозиция) КАК бит_ПланируемыйРасходДенежныхСредствОбороты
		|ГДЕ
		|	бит_ПланируемыйРасходДенежныхСредствОбороты.Регистратор ССЫЛКА Документ.бит_ЗакрытиеЗаявок
		|	И &Условие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбщиеДанные.СуммаПриход - ВЫБОР
		|		КОГДА ДанныеПоДокументамЗакрытия.СуммаРасход ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ДанныеПоДокументамЗакрытия.СуммаРасход
		|	КОНЕЦ КАК СуммаРезультат
		|ИЗ
		|	ОбщиеДанные КАК ОбщиеДанные,
		|	ДанныеПоДокументамЗакрытия КАК ДанныеПоДокументамЗакрытия";
	
	Если ЗначениеЗаполнено(СписокДоговоров) Тогда
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		                            "&Условие",
									"бит_ПланируемыйРасходДенежныхСредствОбороты.ДоговорКонтрагента В (&СписокДоговоров)");
		Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		                            "&Условие",
									"бит_ПланируемыйРасходДенежныхСредствОбороты.ДоговорКонтрагента = &ДоговорКонтрагента");
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);

	КонецЕсли;

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.СуммаРезультат) Тогда
			Результат = Выборка.СуммаРезультат;
		КонецЕсли;
		
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции // ВычислитьКонтролируемуюСуммуПоЗаявкам()

// Функция вычисляет контролируемую сумму по проектам договоров.
// 
// Параметры:
// 
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ВычислитьКонтролируемуюСуммуПоПроектам(ПроектДоговора = Неопределено, ДоговорКонтрагента, ОсновнойПроектДоговора = Неопределено, СписокДоговоров = Неопределено)

	УстановитьПривилегированныйРежим(Истина);

	Результат = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ГрафикиДоговоровОбороты.СуммаРеглОборот КАК СуммаРегл

		|ИЗ
		|	РегистрНакопления.бит_ГрафикиДоговоров.Обороты КАК бит_ГрафикиДоговоровОбороты
		|ГДЕ
		|	бит_ГрафикиДоговоровОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И бит_ГрафикиДоговоровОбороты.ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатейОборотов.БДДС)";
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
			
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат = Результат + Выборка.СуммаРегл;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;
	
КонецФункции

// Функция производит поиск графика начислений, у которого в документах планирования указана
// переданная ссылка.
// 
// Параметры:
//  ДокументПланирования - ссылка на документ, для которого надо найти подчиненный документ.
// 	
// Возвращаемое значение:
//  Если нашли, то возвращаем ссылку, не нашли - Неопределено.
// 
Функция НайтиДокументГрафикаНачислений(Знач ДокументПланирования)

	Если Не ЗначениеЗаполнено(ДокументПланирования) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	НайденныйДокумент = Неопределено;

	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);

	Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
    |   ГрафикНачислений.Ссылка КАК ГрафикНачислений
    |ИЗ
    |   Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК ГрафикНачислений
    |ГДЕ
    |   ГрафикНачислений.ДокументПланирования = &ДокументПланирования";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
        
        ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
        
        Если ВыборкаИзЗапроса.Следующий() Тогда
            НайденныйДокумент = ВыборкаИзЗапроса.ГрафикНачислений;
        КонецЕсли;
        
    КонецЕсли;
        
	Возврат НайденныйДокумент;

КонецФункции // НайтиДокументГрафикаНачислений()

// Возвращает перечень типов договоров с поставщиком.
//
// Возвращаемое значение:
//	Массив - Содержит виды договоров с поставщиком.
//
Функция ТипыДоговоровПоставщиков()
	
	ТипыДоговоров = Новый Массив;
	
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СПоставщиком);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СКомитентом);
		
	Возврат ТипыДоговоров;
	
КонецФункции

// Возвращает перечень типов договоров с покупателем.
//
// Возвращаемое значение:
//	Массив - Содержит виды договоров с покупателем.
//
Функция ТипыДоговоровПокупателей()
	
	ТипыДоговоров = Новый Массив;
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СПокупателем);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СКомиссионером);
	ТипыДоговоров.Добавить(Перечисления.ТипыДоговоров.СКомитентомНаЗакупку);
	
	Возврат ТипыДоговоров;
	
КонецФункции

#КонецОбласти
